(Laser control subs 开、关和中断光/粉子程序)
(----------------------------------------------)
%L 1120
(LASER ON)
M20
G04 K0.2
#RET
%L 1121
(LASER OFF)
G04 K0.4
M21
#RET
%L 1122
(LASER INTERBREAK)
G04 K0.4
M21
G04 KP184
M20
G04 K0.2
#RET

(050002-1.igs)
%L 3000
(*********  G Code Refering to Note Sequence  *********)

(1-3 (050002-1.igs))
G91 G01 ZP192 FP109
G90 G01 X29.994 Y34.865 FP109
G91 G01 Z-P192 FP109
#CALL 1120
G91 G01 Y-6.000 FP101
X11.846 FP103
Y6.000 FP102
X11.846 FP103
Y-6.000 FP102
X11.846 FP103
Y6.000 FP102
X11.846 FP103
Y-6.000 FP102
X5.923 FP103
Y6.000 FP101
G91 G01 X-11.846 FP103
Y-6.000 FP102
X-11.846 FP103
Y6.000 FP102
X-11.846 FP103
Y-6.000 FP102
X-11.846 FP103
Y6.000 FP102
X-5.923 FP103
#CALL 1121

(2-3 (050002-1.igs))
G91 G01 ZP192 FP109
G90 G01 X95.299 Y34.865 FP109
G91 G01 Z-P192 FP109
#CALL 1120
G91 G01 X-6.000 FP105
Y-12.800 FP104
X6.000 FP102
Y-12.800 FP104
X-6.000 FP102
Y-6.400 FP104
X6.000 FP105
G91 G01 Y12.800 FP104
X-6.000 FP102
Y12.800 FP104
X6.000 FP102
Y6.400 FP104
#CALL 1121

#RET
(050002-2.igs)
%L 3001
        (SplineLine_0 :[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23])
        G90 G01 X29.926 Y31.865 Z-48.000 FP109
        #CALL 1120
        G90 G01 X24.927 Y31.865 Z-40.000 FP102
        G90 G01 X24.927 Y38.182 Z-40.000 FP102
        G90 G01 X25.700 Y42.928 Z-40.000 FP102
        G90 G01 X29.658 Y48.409 Z-40.000 FP102
        G90 G01 X35.993 Y50.816 Z-40.000 FP102
        G90 G01 X37.648 Y50.903 Z-40.000 FP102
        G90 G01 X87.744 Y50.903 Z-40.000 FP102
        G90 G01 X90.852 Y50.586 Z-40.000 FP102
        G90 G01 X96.850 Y47.451 Z-40.000 FP102
        G90 G01 X100.099 Y41.515 Z-40.000 FP102
        G90 G01 X100.465 Y38.182 Z-40.000 FP102
        G90 G01 X100.465 Y0.380 Z-40.000 FP102
        #CALL 1121

#RET

(050002-smooth.igs)
%L 4000
(**********  G Code Without Note  **********)

(1-F)
G91 G01 ZP192 FP109
G90 G01 X103.481 Y2.865 FP109
G91 G01 Z-P192 FP109
#CALL 1120
G91 G01 Y35.937 FP115
G03 X-15.137 Y15.117 I-15.117 J0.000 FP115
G01 X-51.428 Y-0.067 FP115
G03 X-15.007 Y-15.007 I0.000 J-15.007 FP115
G01 Y-13.479 FP115
X63.889 FP115
Y-22.500 FP115
#CALL 1121

(9-F)
G91 G01 ZP192 FP109
G90 G01 X97.346 Y40.365 FP109
G91 G01 Z-P192 FP109
#CALL 1120
G91 G03 X-9.006 Y7.553 I-8.982 J-1.563 FP115
G01 X-51.424 Y-0.067 FP115
G03 X-8.994 Y-9.486 I0.000 J-9.007 FP115
G01 X69.877 FP115
Y-35.500 FP115
#CALL 1121

#RET


%050002
(Part: XXX-5533220301-001-E)
(SR: MPM-CWZB-GC-022A)
(CS: SC-CT-01/02/04)
(NC: 8070)
(CX: MPM-CWZB-CX-009A)
(Pace: 10/5.0)

(Variable declaration 变量声明)
(using parameter number 使用变量号: 101~112, 115~119, 136~139, 179~185, 191~209)
(==================================================)
P102=1000 (SCANNING VELOCITY 直道扫描速率)
P104=1200 (CORNER SPD 直道为X方向时弯道扫描速率)
P103=1200 (CORNER SPD 直道为Y方向时弯道扫描速率)
P105=800 (SIDE SPD 直道为X方向时边道扫描速率)
P101=800 (SIDE SPD 直道为Y方向时边道扫描速率)
P109=2000 (IN POSITION SPD 定位移动速率)
(----------------------------------------------)
P136=800 (Color Spd Red 颜色-红色线段扫描速率)
P137=800 (Color Spd Green 颜色-绿色线段扫描速率)
P138=750 (Color Spd Blue 颜色-蓝色线段扫描速率)
P139=800 (Color Spd Yellow 颜色-黄色线段扫描速率)
(----------------------------------------------)
P181=7500 (SET LASER POWER 设定激光器功率)
P185=P181*0.78 (Controlled Laser Power 外延辅助扫描时控制激光器功率)
P184=0.5 (Laser On Stay Time 激光开光暂停时间)
P187= 15 (POWDER TIME 粉路通断停留时间)
P191=0.7(Z-INCREMENT 层提升高度)
P192=0 (IN POSITION Z UP 定位时先提Z，到位置再降Z，这一过程中Z的提升高度)
(----------------------------------------------)
P112=0 (Supplement Sup Before Fill Flag 补偿-填充前补偿标识，值取1时先进行边道补偿再走填充程序，取0时走完填充程序后再进行边道补偿)
P195=0 (SUPPLEMENT Z DOWN 	补偿-边道补偿时Z的下降高度，取正值)
P200=0 (SUPPLEMENT OUTLINE SWITCH 补偿-对外轮廓进行补偿的开关，值取1时进行边道补偿)
P115=800 (SUPPLEMENT OUTLINE SPD 补偿-对外轮廓进行补偿的扫描速率)
(----------------------------------------------)
(P110=1) (Block Type Flag 不同分块方式的标识，取值1、2。程序运行前手动设置全局变量，缺省值1)
(P111=1) (Track Type Flag 不同起点开始轨迹的标识：负搭接、轮廓扫描取值1、2；正搭接取值1、2、3、4。程序运行前手动设置全局变量，缺省值1)
(P186=60) (Cool down time 冷却时间)
P193=7 (Not used)
P179=0 (Actual Start Z 真实起始Z高度值。首次运行该程序前需确定该参数，连续执行时通常将其改为上一个程序运行完毕后的实际Z高度值，该程序一旦开始运行不应再修改该参数值)
(在模拟校验时可将P179设为V.A.PPOS.Z，这样只要Z移动范围仍位于软限位内可在任意位置进行校验)
P180=P179-0 (Delta Z 真实起始Z高度与名义起始Z高度之间的差值。)
(==================================================)
P211=3
P212=1
P213=1
P188=0
(Main program 主程序段)
(==================================================)
#PATH ["C:\CNC8070\USERS\Prg\MPM-LCX-2019-124\SUB\"]

G73 (Clear Rotation 清除可能存在的模态旋转指令)
G10 (Clear Mirror 清除可能存在的模态镜像指令)

G05
(#EXPORT)
SP181 M3
M60
G04 K10
G90 G01 Z-50 F1000
#CALL 3000
#CALL 3001

G90 G01 Z-50 F1000
M61
G04 K15
SP185 M3
#CALL 4000

(#DISEXPORT)
M61
M30
(==================================================)
